In [1]:
import pandas as pd

### Gözlem ve Değişken Seçimi: loc & iloc

In [2]:
import numpy as np
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     8    21     4
1    19    11    22
2    28     8    17
3    14    28     3
4    10     8    27
5     9    12    18
6    22    19    20
7    14    18    22
8    15    20    16
9    25    18     4

**loc** => tanımlandığı şekli ile seçim yapmak için kullanılır.

In [3]:
df.loc[0:3] # !! 3. index dahil !!

   var1  var2  var3
0     8    21     4
1    19    11    22
2    28     8    17
3    14    28     3

**!!** 3. index dahil **!!**

**iloc** => alışık olduğumuz indexleme mantığı ile seçim yapar.

In [4]:
df.iloc[0:3]

   var1  var2  var3
0     8    21     4
1    19    11    22
2    28     8    17

In [5]:
df.iloc[:3,:2]

   var1  var2
0     8    21
1    19    11
2    28     8

In [6]:
df.loc[0:3,"var3"]

0     4
1    22
2    17
3     3
Name: var3, dtype: int32

In [8]:
## df.iloc[0:3,"var3"] hata verir.
df.iloc[0:3][["var3"]]

   var3
0     4
1    22
2    17

### Koşullu Eleman İşlemleri

In [9]:
df[df.var1 > 15]

   var1  var2  var3
1    19    11    22
2    28     8    17
6    22    19    20
9    25    18     4

In [10]:
df[(df.var1 > 15) & (df.var3 < 20)]

   var1  var2  var3
2    28     8    17
9    25    18     4

In [11]:
# df[df.var1 > 15, ["var1", "var2"]] hata verir.
# df[df.var1 > 15][["var1", "var2"]] çalışır.
# Ya da :
df.loc[df.var1 > 15, ["var1", "var2"]]

   var1  var2
1    19    11
2    28     8
6    22    19
9    25    18

### Join

In [12]:
m2 = np.random.randint(1,30, size = (5,3))
df2 = pd.DataFrame(m2, columns = ["var1","var2","var3"])
df2

   var1  var2  var3
0    18    27     7
1    11    19     7
2    24    11    14
3    14     4    21
4     9    26     2

In [13]:
df3 = df2 + 99 # her bir değere 99 ekler.
df3

   var1  var2  var3
0   117   126   106
1   110   118   106
2   123   110   113
3   113   103   120
4   108   125   101

In [14]:
pd.concat([df2,df3]) # index değerleri tekrar ediyor!!

   var1  var2  var3
0    18    27     7
1    11    19     7
2    24    11    14
3    14     4    21
4     9    26     2
0   117   126   106
1   110   118   106
2   123   110   113
3   113   103   120
4   108   125   101

In [15]:
pd.concat([df2,df3], ignore_index = True)

   var1  var2  var3
0    18    27     7
1    11    19     7
2    24    11    14
3    14     4    21
4     9    26     2
5   117   126   106
6   110   118   106
7   123   110   113
8   113   103   120
9   108   125   101

In [16]:
df3.columns = ["var1","var2","deg3"]
pd.concat([df2,df3], ignore_index = True)

   var1  var2  var3   deg3
0    18    27   7.0    NaN
1    11    19   7.0    NaN
2    24    11  14.0    NaN
3    14     4  21.0    NaN
4     9    26   2.0    NaN
5   117   126   NaN  106.0
6   110   118   NaN  106.0
7   123   110   NaN  113.0
8   113   103   NaN  120.0
9   108   125   NaN  101.0

In [17]:
pd.concat([df2,df3], join = "inner") # kesişen özelliklerin dışındakileri ignore ettik.

   var1  var2
0    18    27
1    11    19
2    24    11
3    14     4
4     9    26
0   117   126
1   110   118
2   123   110
3   113   103
4   108   125

In [21]:
# pd.concat([df2,df3], join_axes = [df2.columns]) # df2nin sütunları bazında birleştir.
# yürürlükten kaldırıldı !!!

### Merge

In [22]:
df1 = pd.DataFrame({'emp':["Jack","Will","Liz"], 'dep':["acc","eng","hr"]})
df1

    emp  dep
0  Jack  acc
1  Will  eng
2   Liz   hr

In [23]:
df2 = pd.DataFrame({'emp':["Jack","Will","Liz"], 'since':[2000,2005,2007]})
df2

    emp  since
0  Jack   2000
1  Will   2005
2   Liz   2007

In [24]:
pd.merge(df1,df2) # = pd.merge([df1,df2], on = "emp")

    emp  dep  since
0  Jack  acc   2000
1  Will  eng   2005
2   Liz   hr   2007

### Aggregation

**Aggregation Functions =>** count() - first() - last() - mean() - median() -
 min() - max() - std() - var() - sum()

In [27]:
import seaborn as sns

In [28]:
dfp = sns.load_dataset("planets")
dfp

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [31]:
dfp.shape

(1035, 6)

In [33]:
dfp.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [34]:
dfp["mass"].mean()

2.6381605847953233

In [35]:
dfp["mass"].count()

513

In [36]:
dfp.describe() # önemli istatistikleri tabloluyor

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [37]:
dfp.describe().T # transpose'unu al
# dfp.dropna().describe().T dropna() -> eksik değerleri siler.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

### Grouping

In [38]:
dfg = pd.DataFrame({'group':["A","B","C","A","B","C"], 
                    'data':[10,11,52,23,43,55]})
dfg

  group  data
0     A    10
1     B    11
2     C    52
3     A    23
4     B    43
5     C    55

In [39]:
dfg.groupby("group") # tek başına iş yapmaz, aggregation func'a ihtiyaç duyar

In [40]:
dfg.groupby("group").mean()

       data
group
A      16.5
B      27.0
C      53.5

In [41]:
dfp.groupby("method")["orbital_period"].mean()
# birçok değişken olduğu için değişkeni de seçtik. ex:orbital_period

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [42]:
dfp.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### İleri Toplulaştırma İşlemleri

#### aggregate

In [44]:
df = pd.DataFrame({'group':["A","B","C","A","B","C"], 
                   'data1':[10,11,52,23,43,55],
                   'data2':[100,253,333,262,111,969]})
df

  group  data1  data2
0     A     10    100
1     B     11    253
2     C     52    333
3     A     23    262
4     B     43    111
5     C     55    969

İstediğimiz aggregation fonksiyonlarını seçip beraber uygulamak için kullanılır.

In [45]:
df.groupby("group").aggregate(["min",np.median,max]) # istediğimiz agg. funcları seçtik
# pandasta tanımlı olan min ve maxı farklı, dışarıdan aldığım median foknisyonunu farklı yazdım!!
# min ve maxı tırnak içinde yazıp yazmamamız önemli değil!!

      data1            data2
        min median max   min median  max
group
A        10   16.5  23   100    181  262
B        11   27.0  43   111    182  253
C        52   53.5  55   333    651  969

In [46]:
df.groupby("group").aggregate({"data1":"min", "data2":max})
# iki değişken için farklı istatistikleri hesapladı - sözlük yapısı ile

       data1  data2
group
A         10    262
B         11    253
C         52    969

#### filter

In [48]:
df.groupby("group").std()

           data1       data2
group
A       9.192388  114.551299
B      22.627417  100.409163
C       2.121320  449.719913

In [47]:
def filter_func(x):
    return x["data1"].std() > 9
df.groupby("group").filter(filter_func)

  group  data1  data2
0     A     10    100
1     B     11    253
3     A     23    262
4     B     43    111

In [49]:
(df.groupby("group").filter(filter_func)).groupby("group")["data1"].std() # I did!

group
A     9.192388
B    22.627417
Name: data1, dtype: float64

#### transform

In [50]:
df["data1"]*9

0     90
1     99
2    468
3    207
4    387
5    495
Name: data1, dtype: int64

In [53]:
df1 = df.iloc[:,1:] # group özelliğinden kurtulduk.
df1

   data1  data2
0     10    100
1     11    253
2     52    333
3     23    262
4     43    111
5     55    969

In [54]:
df1.transform(lambda x: x-x.mean())

       data1  data2
0 -22.333333 -238.0
1 -21.333333  -85.0
2  19.666667   -5.0
3  -9.333333  -76.0
4  10.666667 -227.0
5  22.666667  631.0

In [55]:
df1 # orijinal dataFrame değişmedi

   data1  data2
0     10    100
1     11    253
2     52    333
3     23    262
4     43    111
5     55    969

#### apply

In [57]:
df1.apply(np.sum)

data1     194
data2    2028
dtype: int64

In [58]:
df.groupby("group").apply(np.sum)

      group  data1  data2
group
A        AA     33    362
B        BB     54    364
C        CC    107   1302

In [59]:
df.groupby("group").apply(np.mean) # fonksiyonu uygulayamadığı özelliği ekarte ediyor.

       data1  data2
group
A       16.5  181.0
B       27.0  182.0
C       53.5  651.0

### Pivot Tablolar

Veri setleri üzerinde bazı satır ve sütun işlemleri ypaarak veri setini amaca uygun hale getirmek için kullanılan yapılardır. Çok boyutlu groupby() olarak düşünülebilir.

In [60]:
t = sns.load_dataset("titanic")
t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [62]:
t.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [63]:
t.groupby("sex")[["survived"]].mean() # dataFrame olarak gelir iki [] yaparsak

        survived
sex
female  0.742038
male    0.188908

In [66]:
t.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [67]:
t.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [68]:
t.pivot_table("survived", index="sex", columns = "class") # kısa yol

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

**ex:** Yaşları da kategorileştirerek pivot table'a ekle.

In [69]:
age = pd.cut(t["age"], [0,18,90]) # yaşları verilen değerleri göre böl
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [70]:
t.pivot_table("survived", ["sex",age], "class")
# age'i tırnak içine alma ki bizim yarattığımız age'i dışarıdan alsın.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

### Dış Kaynaklı Veri Okumak

In [ ]:
# tekrar bak